/**
 * Created by medo_zy on 2017-9-20.
 */
/********** 航天器系列 **********/
var GP =['神舟系列','天宫系列','尖兵系列','其他系列'];
/********** 航天器型号一 **********/
var GT = [
    ['神舟一号','神舟二号','神舟三号','神舟四号','神舟五号','神舟六号','神舟七号','神舟八号','神舟九号','神舟十号'],
    ['天宫一号','天宫二号','天宫三号','天宫四号','天宫五号','天宫六号','天宫七号','天宫八号','天宫九号','天宫十号'],
    ['尖兵一号','尖兵二号','尖兵三号','尖兵四号','尖兵五号','尖兵六号','尖兵七号','尖兵八号','尖兵九号'],
    ['其他系列'],
];

/********** 航天器型号二 **********/
var GC =[
    [
        ['神舟一号','神舟二号','神舟三号','神舟四号','神舟五号','神舟六号','神舟七号','神舟八号','神舟九号','神舟十号'],
        ['神舟一号','神舟二号','神舟三号','神舟四号','神舟五号','神舟六号','神舟七号','神舟八号','神舟九号','神舟十号'],
        ['神舟一号','神舟二号','神舟三号','神舟四号','神舟五号','神舟六号','神舟七号','神舟八号','神舟九号','神舟十号'],
        ['神舟一号','神舟二号','神舟三号','神舟四号','神舟五号','神舟六号','神舟七号','神舟八号','神舟九号','神舟十号'],
        ['神舟一号','神舟二号','神舟三号','神舟四号','神舟五号','神舟六号','神舟七号','神舟八号','神舟九号','神舟十号'],
        ['神舟一号','神舟二号','神舟三号','神舟四号','神舟五号','神舟六号','神舟七号','神舟八号','神舟九号','神舟十号'],
        ['神舟一号','神舟二号','神舟三号','神舟四号','神舟五号','神舟六号','神舟七号','神舟八号','神舟九号','神舟十号'],
        ['神舟一号','神舟二号','神舟三号','神舟四号','神舟五号','神舟六号','神舟七号','神舟八号','神舟九号','神舟十号'],
        ['神舟一号','神舟二号','神舟三号','神舟四号','神舟五号','神舟六号','神舟七号','神舟八号','神舟九号','神舟十号'],
        ['神舟一号','神舟二号','神舟三号','神舟四号','神舟五号','神舟六号','神舟七号','神舟八号','神舟九号','神舟十号'],
        ['神舟一号','神舟二号','神舟三号','神舟四号','神舟五号','神舟六号','神舟七号','神舟八号','神舟九号','神舟十号']
    ],
    [
        ['天宫一号','天宫二号','天宫三号','天宫四号','天宫五号','天宫六号','天宫七号','天宫八号','天宫九号','天宫十号'],
        ['天宫一号','天宫二号','天宫三号','天宫四号','天宫五号','天宫六号','天宫七号','天宫八号','天宫九号','天宫十号'],
        ['天宫一号','天宫二号','天宫三号','天宫四号','天宫五号','天宫六号','天宫七号','天宫八号','天宫九号','天宫十号'],
        ['天宫一号','天宫二号','天宫三号','天宫四号','天宫五号','天宫六号','天宫七号','天宫八号','天宫九号','天宫十号'],
        ['天宫一号','天宫二号','天宫三号','天宫四号','天宫五号','天宫六号','天宫七号','天宫八号','天宫九号','天宫十号'],
        ['天宫一号','天宫二号','天宫三号','天宫四号','天宫五号','天宫六号','天宫七号','天宫八号','天宫九号','天宫十号'],
        ['天宫一号','天宫二号','天宫三号','天宫四号','天宫五号','天宫六号','天宫七号','天宫八号','天宫九号','天宫十号'],
        ['天宫一号','天宫二号','天宫三号','天宫四号','天宫五号','天宫六号','天宫七号','天宫八号','天宫九号','天宫十号'],
        ['天宫一号','天宫二号','天宫三号','天宫四号','天宫五号','天宫六号','天宫七号','天宫八号','天宫九号','天宫十号'],
        ['天宫一号','天宫二号','天宫三号','天宫四号','天宫五号','天宫六号','天宫七号','天宫八号','天宫九号','天宫十号'],
        ['天宫一号','天宫二号','天宫三号','天宫四号','天宫五号','天宫六号','天宫七号','天宫八号','天宫九号','天宫十号']
    ],[
        ['尖兵一号','尖兵二号','尖兵三号','尖兵四号','尖兵五号','尖兵六号','尖兵七号','尖兵八号','尖兵九号'],
        ['尖兵一号','尖兵二号','尖兵三号','尖兵四号','尖兵五号','尖兵六号','尖兵七号','尖兵八号','尖兵九号'],
        ['尖兵一号','尖兵二号','尖兵三号','尖兵四号','尖兵五号','尖兵六号','尖兵七号','尖兵八号','尖兵九号'],
        ['尖兵一号','尖兵二号','尖兵三号','尖兵四号','尖兵五号','尖兵六号','尖兵七号','尖兵八号','尖兵九号'],
        ['尖兵一号','尖兵二号','尖兵三号','尖兵四号','尖兵五号','尖兵六号','尖兵七号','尖兵八号','尖兵九号'],
        ['尖兵一号','尖兵二号','尖兵三号','尖兵四号','尖兵五号','尖兵六号','尖兵七号','尖兵八号','尖兵九号'],
        ['尖兵一号','尖兵二号','尖兵三号','尖兵四号','尖兵五号','尖兵六号','尖兵七号','尖兵八号','尖兵九号'],
        ['尖兵一号','尖兵二号','尖兵三号','尖兵四号','尖兵五号','尖兵六号','尖兵七号','尖兵八号','尖兵九号'],
        ['尖兵一号','尖兵二号','尖兵三号','尖兵四号','尖兵五号','尖兵六号','尖兵七号','尖兵八号','尖兵九号'],
        ['尖兵一号','尖兵二号','尖兵三号','尖兵四号','尖兵五号','尖兵六号','尖兵七号','尖兵八号','尖兵九号']
    ],[
        ['其他系列']
    ]
]

$(function(){
    $("#test").ProvinceCity();
});
$.fn.ProvinceCity = function(){
    var _self = this;
//定义3个默认值
    _self.data("seriesName",["请选择", ""]);
    _self.data("typeName",["请选择", ""]);
    _self.data("typeNameTwo",["请选择", ""]);
//分别获取3个下拉框
    var $sel1 = $("#seriesName");
    var $sel2 = $("#typeName");
    var $sel3 = $("#typeNameTwo");
//默认省级下拉
    if(_self.data("seriesName")){
        $sel1.append("<option value='"+_self.data("seriesName")[1]+"'>"+_self.data("seriesName")[0]+"</option>");
    }
    $.each( GP , function(index,data){
        $sel1.append("<option value='"+data+"'>"+data+"</option>");
    });
//默认的1级城市下拉
    if(_self.data("typeName")){
        $sel2.append("<option value='"+_self.data("typeName")[1]+"'>"+_self.data("typeName")[0]+"</option>");
    }
//默认的2级城市下拉
    if(_self.data("typeNameTwo")){
        $sel3.append("<option value='"+_self.data("typeNameTwo")[1]+"'>"+_self.data("typeNameTwo")[0]+"</option>");
    }
//省级联动 控制
    var index1 = "" ;
    $sel1.change(function(){
//清空其它2个下拉框
        $sel2[0].options.length=0;
        $sel3[0].options.length=0;
        index1 = this.selectedIndex;
        if(index1==0){
//当选择的为 “请选择” 时
            if(_self.data("typeName")){
                $sel2.append("<option value='"+_self.data("typeName")[1]+"'>"+_self.data("typeName")[0]+"</option>");
            }
            if(_self.data("typeNameTwo")){
                $sel3.append("<option value='"+_self.data("typeNameTwo")[1]+"'>"+_self.data("typeNameTwo")[0]+"</option>");
            }
        }else{
            $.each( GT[index1-1] , function(index,data){
                $sel2.append("<option value='"+data+"'>"+data+"</option>");
            });
            $.each( GC[index1-1][0] , function(index,data){
                $sel3.append("<option value='"+data+"'>"+data+"</option>");
            })
        }
    }).change();
//1级城市联动 控制
    var index2 = "" ;
    $sel2.change(function(){
        $sel3[0].options.length=0;
        index2 = this.selectedIndex;
        $.each( GC[index1-1][index2] , function(index,data){
            $sel3.append("<option value='"+data+"'>"+data+"</option>");
        })
    });
    return _self;
};